In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
data = {
    'Country': ['China', 'India', 'Brazil'],
    'Capital': ['Beijing', 'New Delhi', 'Brasilia'],
    'Population': ['1432732201', '1303171635', '207847528']
}

In [4]:
s1 = Series(data['Country'])

In [5]:
s1

0     China
1     India
2    Brazil
dtype: object

In [6]:
s1.values

array(['China', 'India', 'Brazil'], dtype=object)

In [7]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
s2 = Series(data['Capital'])
s3 = Series(data['Population'])

In [9]:
df = DataFrame(data)

In [10]:
df

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

In [11]:
for row in df.iterrows():
    print(row)

(0, Country            China
Capital          Beijing
Population    1432732201
Name: 0, dtype: object)
(1, Country            India
Capital        New Delhi
Population    1303171635
Name: 1, dtype: object)
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)

In [12]:
for row in df.iterrows():
    print(row[0], row[1])
    break

0 Country            China
Capital          Beijing
Population    1432732201
Name: 0, dtype: object

# 通过Series创建DataFrame

In [ ]:
s1=pd.Series(data['Capital'])
s2=pd.Series(data['Country'])
s3=pd.Series(data['Population'])

In [13]:
df_new = DataFrame([s1,s2,s3])

In [14]:
df_new

            0           1          2
0       China       India     Brazil
1     Beijing   New Delhi   Brasilia
2  1432732201  1303171635  207847528

In [15]:
df

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

In [17]:
df_new = DataFrame([s1,s2,s3], index=['Country','Capital', 'Population'])

In [18]:
df_new

                     0           1          2
Country          China       India     Brazil
Capital        Beijing   New Delhi   Brasilia
Population  1432732201  1303171635  207847528

In [19]:
# 转置
df_new.T

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

In [20]:
df

  Country    Capital  Population
0   China    Beijing  1432732201
1   India  New Delhi  1303171635
2  Brazil   Brasilia   207847528

![区别](./Series和DataFrame.png)